Masmiseim36/nxpSDK/devices/MIMXRT1181/drivers/fsl_tpm.h
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2021, 2022, 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#ifndef FSL_TPM_H_
#define FSL_TPM_H_

#include "fsl_common.h"

/*
 * $Coverage Justification Reference$
 *
 * $Justification tpm_h_ref_1$
 * Hardware limitations make this code impossible to implement.
 *
 * $Justification tpm_h_ref_2$
 * Hardware limitations make this code impossible to implement.
 */

/*!
 * @addtogroup tpm
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*! @{ */
/*! @brief TPM driver version 2.4.0. */
#define FSL_TPM_DRIVER_VERSION (MAKE_VERSION(2, 4, 0))
/*! @} */

/*!
 * @brief Max loops to wait for writing register.
 *
 * When writing MOD CnV CnSC and SC register, driver will wait until register is updated.
 * This parameter defines how many loops to check completion before return timeout.
 * If defined as 0, driver will wait forever until completion.
 */
#ifndef TPM_TIMEOUT
#ifdef CONFIG_TPM_TIMEOUT
#define TPM_TIMEOUT CONFIG_TPM_TIMEOUT
#else
#define TPM_TIMEOUT 0
#endif
#endif

/*! @brief Help macro to get the max counter value */
#define TPM_MAX_COUNTER_VALUE(x) ((1U != (uint8_t)FSL_FEATURE_TPM_HAS_32BIT_COUNTERn(x)) ? 0xFFFFU : 0xFFFFFFFFU)

/*!
 * @brief List of TPM channels.
 * @note Actual number of available channels is SoC dependent
 */
typedef enum _tpm_chnl
{
    kTPM_Chnl_0 = 0U, /*!< TPM channel number 0*/
    kTPM_Chnl_1,      /*!< TPM channel number 1 */
    kTPM_Chnl_2,      /*!< TPM channel number 2 */
    kTPM_Chnl_3,      /*!< TPM channel number 3 */
    kTPM_Chnl_4,      /*!< TPM channel number 4 */
    kTPM_Chnl_5,      /*!< TPM channel number 5 */
    kTPM_Chnl_6,      /*!< TPM channel number 6 */
    kTPM_Chnl_7       /*!< TPM channel number 7 */
} tpm_chnl_t;

/*! @brief TPM PWM operation modes */
typedef enum _tpm_pwm_mode
{
    kTPM_EdgeAlignedPwm = 0U, /*!< Edge aligned PWM */
    kTPM_CenterAlignedPwm,    /*!< Center aligned PWM */
#if defined(FSL_FEATURE_TPM_HAS_COMBINE) && FSL_FEATURE_TPM_HAS_COMBINE
    kTPM_CombinedPwm /*!< Combined PWM (Edge-aligned, center-aligned, or asymmetrical PWMs can be obtained in combined
                        mode using different software configurations) */
#endif
} tpm_pwm_mode_t;

/*!
 * @brief TPM PWM output pulse mode: high-true, low-true or no output
 *
 * @note When the TPM has PWM pause level select feature, the PWM output cannot be turned off by selecting the output
 *       level. In this case, the channel must be closed to close the PWM output.
 */
typedef enum _tpm_pwm_level_select
{
#if !(defined(FSL_FEATURE_TPM_HAS_PAUSE_LEVEL_SELECT) && FSL_FEATURE_TPM_HAS_PAUSE_LEVEL_SELECT)
    kTPM_NoPwmSignal = 0U, /*!< No PWM output on pin */
    kTPM_LowTrue,          /*!< Low true pulses */
    kTPM_HighTrue          /*!< High true pulses */
#else
    kTPM_HighTrue = 0U, /*!< High true pulses */
    kTPM_LowTrue        /*!< Low true pulses */
#endif
} tpm_pwm_level_select_t;

#if (defined(FSL_FEATURE_TPM_HAS_PAUSE_LEVEL_SELECT) && FSL_FEATURE_TPM_HAS_PAUSE_LEVEL_SELECT)
/*! @brief TPM PWM output when first enabled or paused: set or clear */
typedef enum _tpm_pwm_pause_level_select
{
    kTPM_ClearOnPause = 0U, /*!< Clear Output when counter first enabled or paused. */
    kTPM_SetOnPause         /*!< Set Output when counter first enabled or paused. */
} tpm_pwm_pause_level_select_t;
#endif

/*! @brief List of TPM channel modes and level control bit mask */
typedef enum _tpm_chnl_control_bit_mask
{
    kTPM_ChnlELSnAMask = TPM_CnSC_ELSA_MASK, /*!< Channel ELSA bit mask.*/
    kTPM_ChnlELSnBMask = TPM_CnSC_ELSB_MASK, /*!< Channel ELSB bit mask.*/
    kTPM_ChnlMSAMask   = TPM_CnSC_MSA_MASK,  /*!< Channel MSA bit mask.*/
    kTPM_ChnlMSBMask   = TPM_CnSC_MSB_MASK,  /*!< Channel MSB bit mask.*/
} tpm_chnl_control_bit_mask_t;

/*! @brief Options to configure a TPM channel's PWM signal */
typedef struct _tpm_chnl_pwm_signal_param
{
    tpm_chnl_t chnlNumber; /*!< TPM channel to configure.
                                In combined mode (available in some SoC's), this represents the
                                channel pair number */
#if (defined(FSL_FEATURE_TPM_HAS_PAUSE_LEVEL_SELECT) && FSL_FEATURE_TPM_HAS_PAUSE_LEVEL_SELECT)
    tpm_pwm_pause_level_select_t pauseLevel; /*!< PWM output level when counter first enabled or paused */
#endif
    tpm_pwm_level_select_t level; /*!< PWM output active level select */
    uint8_t dutyCyclePercent;     /*!< PWM pulse width, value should be between 0 to 100
                                       0=inactive signal(0% duty cycle)...
                                       100=always active signal (100% duty cycle)*/
#if defined(FSL_FEATURE_TPM_HAS_COMBINE) && FSL_FEATURE_TPM_HAS_COMBINE
    uint8_t firstEdgeDelayPercent; /*!< Used only in combined PWM mode to generate asymmetrical PWM.
                                        Specifies the delay to the first edge in a PWM period.
                                        If unsure, leave as 0. Should be specified as percentage
                                        of the PWM period, (dutyCyclePercent + firstEdgeDelayPercent) value
                                        should be not greate than 100. */
    bool enableComplementary;      /*!< Used only in combined PWM mode.
                                        true: The combined channels output complementary signals;
                                        false: The combined channels output same signals; */
#if (defined(FSL_FEATURE_TPM_HAS_PAUSE_LEVEL_SELECT) && FSL_FEATURE_TPM_HAS_PAUSE_LEVEL_SELECT)
    tpm_pwm_pause_level_select_t secPauseLevel; /*!< Used only in combined PWM mode. Define the second channel output
                                                   level when counter first enabled or paused */
#endif
    uint8_t deadTimeValue[2]; /*!< The dead time value for channel n and n+1 in combined complementary PWM mode.
                               Deadtime insertion is disabled when this value is zero, otherwise deadtime insertion for
                               channel n/n+1 is configured as (deadTimeValue * 4) clock cycles. deadTimeValue's
                               available range is 0 ~ 15. */
#endif
} tpm_chnl_pwm_signal_param_t;

#if !(defined(FSL_FEATURE_TPM_HAS_NO_CONF) && FSL_FEATURE_TPM_HAS_NO_CONF)
/*!
 * @brief Trigger sources available.
 *
 * This is used for both internal & external trigger sources (external trigger sources available in certain SoC's)
 *
 * @note The actual trigger sources available is SoC-specific.
 */
typedef enum _tpm_trigger_select
{
    kTPM_Trigger_Select_0 = 0U,
    kTPM_Trigger_Select_1,
    kTPM_Trigger_Select_2,
    kTPM_Trigger_Select_3,
    kTPM_Trigger_Select_4,
    kTPM_Trigger_Select_5,
    kTPM_Trigger_Select_6,
    kTPM_Trigger_Select_7,
    kTPM_Trigger_Select_8,
    kTPM_Trigger_Select_9,
    kTPM_Trigger_Select_10,
    kTPM_Trigger_Select_11,
    kTPM_Trigger_Select_12,
    kTPM_Trigger_Select_13,
    kTPM_Trigger_Select_14,
    kTPM_Trigger_Select_15
} tpm_trigger_select_t;

#if defined(FSL_FEATURE_TPM_HAS_EXTERNAL_TRIGGER_SELECTION) && FSL_FEATURE_TPM_HAS_EXTERNAL_TRIGGER_SELECTION
/*!
 * @brief Trigger source options available
 *
 * @note This selection is available only on some SoC's. For SoC's without this selection, the only
 * trigger source available is internal triger.
 */
typedef enum _tpm_trigger_source
{
    kTPM_TriggerSource_External = 0U, /*!< Use external trigger input */
    kTPM_TriggerSource_Internal       /*!< Use internal trigger (channel pin input capture) */
} tpm_trigger_source_t;

/*!
 * @brief External trigger source polarity
 *
 * @note Selects the polarity of the external trigger source.
 */
typedef enum _tpm_ext_trigger_polarity
{
    kTPM_ExtTrigger_Active_High = 0U, /*!< External trigger input is active high */
    kTPM_ExtTrigger_Active_Low        /*!< External trigger input is active low */
} tpm_ext_trigger_polarity_t;
#endif
#endif

/*! @brief TPM output compare modes */
typedef enum _tpm_output_compare_mode
{
    kTPM_NoOutputSignal  = (1U << TPM_CnSC_MSA_SHIFT), /*!< No channel output when counter reaches CnV  */
    kTPM_ToggleOnMatch   = ((1U << TPM_CnSC_MSA_SHIFT) | (1U << TPM_CnSC_ELSA_SHIFT)), /*!< Toggle output */
    kTPM_ClearOnMatch    = ((1U << TPM_CnSC_MSA_SHIFT) | (2U << TPM_CnSC_ELSA_SHIFT)), /*!< Clear output */
    kTPM_SetOnMatch      = ((1U << TPM_CnSC_MSA_SHIFT) | (3U << TPM_CnSC_ELSA_SHIFT)), /*!< Set output */
    kTPM_HighPulseOutput = ((3U << TPM_CnSC_MSA_SHIFT) | (1U << TPM_CnSC_ELSA_SHIFT)), /*!< Pulse output high */
    kTPM_LowPulseOutput  = ((3U << TPM_CnSC_MSA_SHIFT) | (2U << TPM_CnSC_ELSA_SHIFT))  /*!< Pulse output low */
} tpm_output_compare_mode_t;

/*! @brief TPM input capture edge */
typedef enum _tpm_input_capture_edge
{
    kTPM_RisingEdge      = (1U << TPM_CnSC_ELSA_SHIFT), /*!< Capture on rising edge only */
    kTPM_FallingEdge     = (2U << TPM_CnSC_ELSA_SHIFT), /*!< Capture on falling edge only */
    kTPM_RiseAndFallEdge = (3U << TPM_CnSC_ELSA_SHIFT)  /*!< Capture on rising or falling edge */
} tpm_input_capture_edge_t;

