Masmiseim36/nxpSDK/devices/MIMXRT1181/drivers/fsl_tpm.h
#if defined(FSL_FEATURE_TPM_HAS_COMBINE) && FSL_FEATURE_TPM_HAS_COMBINE
/*!
 * @brief Configures the dual edge capture mode of the TPM.
 *
 * This function allows to measure a pulse width of the signal on the input of channel of a
 * channel pair. The filter function is disabled if the filterVal argument passed is zero.
 *
 * @param base           TPM peripheral base address
 * @param chnlPairNumber The TPM channel pair number; options are 0, 1, 2, 3
 * @param edgeParam      Sets up the dual edge capture function
 * @param filterValue    Filter value, specify 0 to disable filter.
 */
void TPM_SetupDualEdgeCapture(TPM_Type *base,
                              tpm_chnl_t chnlPairNumber,
                              const tpm_dual_edge_capture_param_t *edgeParam,
                              uint32_t filterValue);
#endif

#if defined(FSL_FEATURE_TPM_HAS_QDCTRL) && FSL_FEATURE_TPM_HAS_QDCTRL
/*!
 * @brief Configures the parameters and activates the quadrature decode mode.
 *
 * @param base         TPM peripheral base address
 * @param phaseAParams Phase A configuration parameters
 * @param phaseBParams Phase B configuration parameters
 * @param quadMode     Selects encoding mode used in quadrature decoder mode
 */
void TPM_SetupQuadDecode(TPM_Type *base,
                         const tpm_phase_params_t *phaseAParams,
                         const tpm_phase_params_t *phaseBParams,
                         tpm_quad_decode_mode_t quadMode);
#endif

#if defined(FSL_FEATURE_TPM_HAS_POL) && FSL_FEATURE_TPM_HAS_POL
/*!
 * @brief Set the input and output polarity of each of the channels.
 *
 * @param base       TPM peripheral base address
 * @param chnlNumber The channel number
 * @param enable     true: Set the channel polarity to active high;
 *                   false: Set the channel polarity to active low;
 */
static inline void TPM_SetChannelPolarity(TPM_Type *base, tpm_chnl_t chnlNumber, bool enable)
{
    assert(1U == (uint8_t)FSL_FEATURE_TPM_POL_HAS_EFFECTn(base));
    if (enable)
    {
        base->POL &= ~((uint32_t)TPM_POL_POL0_MASK << (uint8_t)chnlNumber);
    }
    else
    {
        base->POL |= (uint32_t)TPM_POL_POL0_MASK << (uint8_t)chnlNumber;
    }
}
#endif
#if defined(FSL_FEATURE_TPM_HAS_TRIG) && FSL_FEATURE_TPM_HAS_TRIG
/*!
 * @brief Enable external trigger input to be used by channel.
 *
 * In input capture mode, configures the trigger input that is used by the channel to capture the
 * counter value. In output compare or PWM mode, configures the trigger input used to modulate
 * the channel output. When modulating the output, the output is forced to the channel initial
 * value whenever the trigger is not asserted.
 *
 * @note No matter how many external trigger sources there are, only input trigger 0 and 1 are used. The even numbered
 *      channels share the input trigger 0 and the odd numbered channels share the second input trigger 1.
 *
 * @param base       TPM peripheral base address
 * @param chnlNumber The channel number
 * @param enable     true: Configures trigger input 0 or 1 to be used by channel;
 *                   false: Trigger input has no effect on the channel
 */
static inline void TPM_EnableChannelExtTrigger(TPM_Type *base, tpm_chnl_t chnlNumber, bool enable)
{
    assert(1U == (uint8_t)FSL_FEATURE_TPM_TRIG_HAS_EFFECTn(base));
    if (enable)
    {
        base->TRIG |= (uint32_t)TPM_TRIG_TRIG0_MASK << (uint8_t)chnlNumber;
    }
    else
    {
        base->TRIG &= ~((uint32_t)TPM_TRIG_TRIG0_MASK << (uint8_t)chnlNumber);
    }
}
#endif
/*! @}*/

/*!
 * @name Interrupt Interface
 * @{
 */

/*!
 * @brief Enables the selected TPM interrupts.
 *
 * @param base TPM peripheral base address
 * @param mask The interrupts to enable. This is a logical OR of members of the
 *             enumeration ::tpm_interrupt_enable_t
 */
void TPM_EnableInterrupts(TPM_Type *base, uint32_t mask);

/*!
 * @brief Disables the selected TPM interrupts.
 *
 * @param base TPM peripheral base address
 * @param mask The interrupts to disable. This is a logical OR of members of the
 *             enumeration ::tpm_interrupt_enable_t
 */
void TPM_DisableInterrupts(TPM_Type *base, uint32_t mask);

/*!
 * @brief Gets the enabled TPM interrupts.
 *
 * @param base TPM peripheral base address
 *
 * @return The enabled interrupts. This is the logical OR of members of the
 *         enumeration ::tpm_interrupt_enable_t
 */
uint32_t TPM_GetEnabledInterrupts(TPM_Type *base);

/*!
 * @brief Register callback.
 * 
 * If channel or overflow interrupt is enabled by the user, then a callback can be registered
 * which will be invoked when the interrupt is triggered.
 *
 * @param base       TPM peripheral base address
 * @param callback   Callback function
 */
void TPM_RegisterCallBack(TPM_Type *base, tpm_callback_t callback);

/*! @}*/

/*!
 * @name Status Interface
 * @{
 */
/*!
 * @brief Gets the TPM channel value
 *
 * @note  The TPM channel value contain the captured TPM counter value for the input modes or the match value for the
 *        output modes.
 *
 * @param base       TPM peripheral base address
 * @param chnlNumber The channel number
 * @return The channle CnV regisyer value.
 */
static inline uint32_t TPM_GetChannelValue(TPM_Type *base, tpm_chnl_t chnlNumber)
{
    return base->CONTROLS[chnlNumber].CnV;
}

/*!
 * @brief Gets the TPM status flags
 *
 * @param base TPM peripheral base address
 *
 * @return The status flags. This is the logical OR of members of the
 *         enumeration ::tpm_status_flags_t
 */
static inline uint32_t TPM_GetStatusFlags(TPM_Type *base)
{
    uint32_t statusFlags = 0;

#if defined(FSL_FEATURE_TPM_HAS_NO_STATUS) && FSL_FEATURE_TPM_HAS_NO_STATUS
    uint8_t chanlNumber = 0;

    /* Check the timer flag */
    if (0U != (base->SC & TPM_SC_TOF_MASK))
    {
        statusFlags |= (uint32_t)kTPM_TimeOverflowFlag;
    }

    for (chanlNumber = 0; (int8_t)chanlNumber < FSL_FEATURE_TPM_CHANNEL_COUNTn(base); chanlNumber++)
    {
        /* Check the channel flag */
        if (0U != (base->CONTROLS[chanlNumber].CnSC & TPM_CnSC_CHF_MASK))
        {
            statusFlags |= (1UL << chanlNumber);
        }
    }
#else
    statusFlags = base->STATUS;
#endif

    return statusFlags;
}

/*!
 * @brief Clears the TPM status flags
 *
 * @param base TPM peripheral base address
 * @param mask The status flags to clear. This is a logical OR of members of the
 *             enumeration ::tpm_status_flags_t
 */
static inline void TPM_ClearStatusFlags(TPM_Type *base, uint32_t mask)
{
#if defined(FSL_FEATURE_TPM_HAS_NO_STATUS) && FSL_FEATURE_TPM_HAS_NO_STATUS
    uint32_t chnlStatusFlags = (mask & 0xFFU);
    uint8_t chnlNumber       = 0;

