Masmiseim36/nxpSDK/devices/MIMXRT1181/drivers/fsl_tpm.h
    /* Clear the timer overflow flag by writing a 0 to the bit while it is set */
    if (0U != (mask & (uint32_t)kTPM_TimeOverflowFlag))
    {
        base->SC &= ~TPM_SC_TOF_MASK;
    }
    /* Clear the channel flag */
    while (0U != chnlStatusFlags)
    {
        if (0U != (chnlStatusFlags & 0x1U))
        {
            base->CONTROLS[chnlNumber].CnSC &= ~TPM_CnSC_CHF_MASK;
        }
        chnlNumber++;
        chnlStatusFlags = chnlStatusFlags >> 1U;
    }
#else
    /* Clear the status flags */
    base->STATUS = mask;
#endif
}

/*! @}*/

/*!
 * @name Read and write the timer period
 * @{
 */

/*!
 * @brief Sets the timer period in units of ticks.
 *
 * Timers counts from 0 until it equals the count value set here. The count value is written to
 * the MOD register.
 *
 * @note
 * 1. This API allows the user to use the TPM module as a timer. Do not mix usage
 *    of this API with TPM's PWM setup API's.
 * 2. Call the utility macros provided in the fsl_common.h to convert usec or msec to ticks.
 *
 * @param base TPM peripheral base address
 * @param ticks A timer period in units of ticks, which should be equal or greater than 1.
 * @return kStatus_Success PWM setup successful
 *         kStatus_Timeout PWM setup timeout when write register CnSC
 */
static inline status_t TPM_SetTimerPeriod(TPM_Type *base, uint32_t ticks)
{
#if TPM_TIMEOUT
    uint32_t timeout = TPM_TIMEOUT;
#endif
    if (1U != (uint8_t)FSL_FEATURE_TPM_HAS_32BIT_COUNTERn(base))
    {
        assert(ticks <= 0xFFFFU);
    }

    /* 
     * According to ERR008068, if writing the modulo register (TPMx_MOD) more than once when the timer counter is
     * disabled, and writes occur at a frequency faster than the TPM asynchronous clock, the registers may not 
     * update correctly.
     * This issue occurs when the register is written an even number of times but does not appear when the register
     * is written an odd number of times.
     * Use do...while loop to ensure modulo register is updated.
     */
    do
    {
#if TPM_TIMEOUT
        if (timeout-- == 0U)
        {
            return kStatus_Timeout;
        }
#endif
        base->MOD = ticks;
        /*
         * $Branch Coverage Justification$
         * (ticks != base->MOD) not covered. $ref tpm_h_ref_2$.
         */
    } while (ticks != base->MOD);

    return kStatus_Success;
}

/*!
 * @brief Reads the current timer counting value.
 *
 * This function returns the real-time timer counting value in a range from 0 to a
 * timer period.
 *
 * @note Call the utility macros provided in the fsl_common.h to convert ticks to usec or msec.
 *
 * @param base TPM peripheral base address
 *
 * @return The current counter value in ticks
 */
static inline uint32_t TPM_GetCurrentTimerCount(TPM_Type *base)
{
    return (uint32_t)((base->CNT & TPM_CNT_COUNT_MASK) >> TPM_CNT_COUNT_SHIFT);
}

/*!
 * @name Timer Start and Stop
 * @{
 */

/*!
 * @brief Starts the TPM counter.
 *
 * @param base        TPM peripheral base address
 * @param clockSource TPM clock source; once clock source is set the counter will start running
 */
static inline void TPM_StartTimer(TPM_Type *base, tpm_clock_source_t clockSource)
{
    uint32_t reg = base->SC;
#if defined(FSL_FEATURE_TPM_HAS_SC_CLKS) && FSL_FEATURE_TPM_HAS_SC_CLKS
    reg &= ~(TPM_SC_CLKS_MASK);
    reg |= TPM_SC_CLKS(clockSource);
#else
    reg &= ~(TPM_SC_CMOD_MASK);
    reg |= TPM_SC_CMOD(clockSource);
#endif
    base->SC = reg;
}

/*!
 * @brief Stops the TPM counter.
 *
 * @param base TPM peripheral base address
 * @return kStatus_Success PWM setup successful
 *         kStatus_Timeout PWM setup timeout when write register CnSC
 */
static inline status_t TPM_StopTimer(TPM_Type *base)
{
#if TPM_TIMEOUT
    uint32_t timeout = TPM_TIMEOUT;
#endif

#if defined(FSL_FEATURE_TPM_HAS_SC_CLKS) && FSL_FEATURE_TPM_HAS_SC_CLKS
    /* Set clock source to none to disable counter */
    base->SC &= ~(TPM_SC_CLKS_MASK);

    /* Wait till this reads as zero acknowledging the counter is disabled */
    while (0U != (base->SC & TPM_SC_CLKS_MASK))
    {
#if TPM_TIMEOUT
        if (--timeout == 0U)
        {
            return kStatus_Timeout;
        }
#endif
    }
#else
    /* Set clock source to none to disable counter */
    base->SC &= ~(TPM_SC_CMOD_MASK);

    /* Wait till this reads as zero acknowledging the counter is disabled */
    while (0U != (base->SC & TPM_SC_CMOD_MASK))
    {
#if TPM_TIMEOUT
        if (--timeout == 0U)
        {
            return kStatus_Timeout;
        }
#endif
    }
#endif

    return kStatus_Success;
}

/*! @}*/

#if defined(FSL_FEATURE_TPM_HAS_GLOBAL) && FSL_FEATURE_TPM_HAS_GLOBAL
/*!
 * @brief Performs a software reset on the TPM module.
 *
 * Reset all internal logic and registers, except the Global Register. Remains set until cleared by software.
 *
 * @note TPM software reset is available on certain SoC's only
 *
 * @param base TPM peripheral base address
 */
static inline void TPM_Reset(TPM_Type *base)
{
    base->GLOBAL |= TPM_GLOBAL_RST_MASK;
    base->GLOBAL &= ~TPM_GLOBAL_RST_MASK;
}
#endif

/*!
 * @brief TPM driver IRQ handler common entry.
 *
 * This function provides the common IRQ request entry for TPM.
 *
 * @param instance TPM instance.
 */
void TPM_DriverIRQHandler(uint32_t instance);

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* FSL_TPM_H_ */
